Revit 2024 API
BuiltInFailures.GroupFailures.CannotSwapNestedGroups Property
 Can't replace because one Group is contained in the other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotSwapNestedGroups { get; }
Visual Basic
Public Shared ReadOnly Property CannotSwapNestedGroups As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotSwapNestedGroups {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace